---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsStairsHeight
source: html/ad353c88-8fa0-a393-f404-dd7e88f85e5e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsStairsHeight Property

"Desired Stair Height": Stairs unconnected height

## Syntax (C#)
```csharp
public static ForgeTypeId StairsStairsHeight { get; }
```